app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
    def index
        songs = Song.all

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        song = Song.find_by_id(params[:id])

INSERT INTO "songs" ("title", "artist", "key", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Get Over It"], ["artist", "Eagles"], ["key", "D"], ["created_at", "2020-08-24 21:52:33.190009"], ["updated_at", "2020-08-24 21:52:33.190009"]]
---
    def create
        song = Song.new(song_params)
        if song.save

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
UPDATE "songs" SET "title" = ?, "artist" = ?, "key" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "At Last "], ["artist", " Etta James "], ["key", " Fb"], ["updated_at", "2020-08-26 01:55:06.136450"], ["id", 1]]
---
    def update
        song = Song.find_by_id(params[:id])
        song.update(song_params)

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 1]]
---
    def destroy
        song = Song.find_by_id(params[:id])
        song.destroy